logs/fio-diskrnd/GWDG 4v 8GB/000/log000.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 16384MiB)
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;179531;701;93450;0;0;0.000000;0.000000;83;190557;1418.336092;4936.446888;1.000000%=91;5.000000%=95;10.000000%=125;20.000000%=173;30.000000%=177;40.000000%=181;50.000000%=187;60.000000%=193;70.000000%=205;80.000000%=226;90.000000%=284;95.000000%=14352;99.000000%=21626;99.500000%=24510;99.900000%=25034;99.950000%=25821;99.990000%=92798;0%=0;0%=0;0%=0;86;190565;1424.193187;4936.459793;113664;2399744;99.857029%;179274.322581;165151.881148;0.758703%;13.209344%;5624;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;6.19%;79.68%;7.23%;0.07%;0.01%;0.01%;0.01%;0.38%;2.46%;3.96%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;46433;0;2130;0;4843462;4845579;99.63%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=6771: Sun Jan  7 18:03:55 2024
  write: IOPS=701, BW=175MiB/s (184MB/s)(16.0GiB/93450msec); 0 zone resets
    clat (usec): min=83, max=190557, avg=1418.34, stdev=4936.45
     lat (usec): min=86, max=190565, avg=1424.19, stdev=4936.46
    clat percentiles (usec):
     |  1.00th=[   92],  5.00th=[   96], 10.00th=[  126], 20.00th=[  174],
     | 30.00th=[  178], 40.00th=[  182], 50.00th=[  188], 60.00th=[  194],
     | 70.00th=[  206], 80.00th=[  227], 90.00th=[  285], 95.00th=[14353],
     | 99.00th=[21627], 99.50th=[24511], 99.90th=[25035], 99.95th=[25822],
     | 99.99th=[92799]
   bw (  KiB/s): min=113664, max=2399744, per=99.86%, avg=179274.32, stdev=165151.88, samples=186
   iops        : min=  444, max= 9374, avg=700.29, stdev=645.12, samples=186
  lat (usec)   : 100=6.19%, 250=79.68%, 500=7.23%, 750=0.07%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.38%, 20=2.46%, 50=3.96%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.76%, sys=13.21%, ctx=5624, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=175MiB/s (184MB/s), 175MiB/s-175MiB/s (184MB/s-184MB/s), io=16.0GiB (17.2GB), run=93450-93450msec

Disk stats (read/write):
  vda: ios=0/46433, merge=0/2130, ticks=0/4843462, in_queue=4845579, util=99.63%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 16384MiB)
3;fio-3.28;kube-fio-read;0;0;16777216;48091;187;348860;0;0;0.000000;0.000000;2313;476336;5319.050230;6286.719043;1.000000%=2932;5.000000%=3227;10.000000%=3391;20.000000%=3653;30.000000%=3850;40.000000%=4014;50.000000%=4227;60.000000%=4423;70.000000%=4751;80.000000%=5341;90.000000%=7503;95.000000%=10682;99.000000%=23461;99.500000%=29753;99.900000%=54263;99.950000%=208666;99.990000%=214958;0%=0;0%=0;0%=0;2313;476336;5319.425613;6286.720722;14336;67719;100.000000%;48122.028694;9494.671758;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.124692%;3.296747%;66213;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;38.78%;55.52%;4.20%;1.37%;0.07%;0.05%;0.01%;0.00%;0.00%;0.00%;0.00%;vda;65525;21;0;8;338321;57;338429;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=6780: Sun Jan  7 18:11:18 2024
  read: IOPS=187, BW=47.0MiB/s (49.2MB/s)(16.0GiB/348860msec)
    clat (msec): min=2, max=476, avg= 5.32, stdev= 6.29
     lat (msec): min=2, max=476, avg= 5.32, stdev= 6.29
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    6], 90.00th=[    8], 95.00th=[   11],
     | 99.00th=[   24], 99.50th=[   30], 99.90th=[   55], 99.95th=[  209],
     | 99.99th=[  215]
   bw (  KiB/s): min=14336, max=67719, per=100.00%, avg=48122.03, stdev=9494.67, samples=697
   iops        : min=   56, max=  264, avg=187.86, stdev=37.07, samples=697
  lat (msec)   : 4=38.78%, 10=55.52%, 20=4.20%, 50=1.37%, 100=0.07%
  lat (msec)   : 250=0.05%, 500=0.01%
  cpu          : usr=0.12%, sys=3.30%, ctx=66213, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=47.0MiB/s (49.2MB/s), 47.0MiB/s-47.0MiB/s (49.2MB/s-49.2MB/s), io=16.0GiB (17.2GB), run=348860-348860msec

Disk stats (read/write):
  vda: ios=65525/21, merge=0/8, ticks=338321/57, in_queue=338429, util=100.00%