logs/fio-diskrnd/GWDG 4v 8GB/000/log004.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;183602;717;91378;0;0;0.000000;0.000000;86;172181;1380.790849;3988.356024;1.000000%=90;5.000000%=94;10.000000%=125;20.000000%=173;30.000000%=177;40.000000%=183;50.000000%=189;60.000000%=197;70.000000%=209;80.000000%=236;90.000000%=509;95.000000%=10682;99.000000%=14614;99.500000%=14745;99.900000%=15007;99.950000%=15269;99.990000%=111673;0%=0;0%=0;0%=0;89;172186;1386.543032;3988.392143;148480;1957376;100.000000%;183699.038462;135671.049390;0.400538%;14.382175%;7417;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;6.42%;76.61%;6.96%;0.12%;0.01%;0.01%;0.01%;0.79%;9.06%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45164;0;106;0;4355565;4356919;99.20%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=6857: Sun Jan  7 18:34:45 2024
  write: IOPS=717, BW=179MiB/s (188MB/s)(16.0GiB/91378msec); 0 zone resets
    clat (usec): min=86, max=172181, avg=1380.79, stdev=3988.36
     lat (usec): min=89, max=172186, avg=1386.54, stdev=3988.39
    clat percentiles (usec):
     |  1.00th=[    91],  5.00th=[    95], 10.00th=[   126], 20.00th=[   174],
     | 30.00th=[   178], 40.00th=[   184], 50.00th=[   190], 60.00th=[   198],
     | 70.00th=[   210], 80.00th=[   237], 90.00th=[   510], 95.00th=[ 10683],
     | 99.00th=[ 14615], 99.50th=[ 14746], 99.90th=[ 15008], 99.95th=[ 15270],
     | 99.99th=[111674]
   bw (  KiB/s): min=148480, max=1957376, per=100.00%, avg=183699.04, stdev=135671.05, samples=182
   iops        : min=  580, max= 7646, avg=717.57, stdev=529.96, samples=182
  lat (usec)   : 100=6.42%, 250=76.61%, 500=6.96%, 750=0.12%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.79%, 20=9.06%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.40%, sys=14.38%, ctx=7417, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=179MiB/s (188MB/s), 179MiB/s-179MiB/s (188MB/s-188MB/s), io=16.0GiB (17.2GB), run=91378-91378msec

Disk stats (read/write):
  vda: ios=0/45164, merge=0/106, ticks=0/4355565, in_queue=4356919, util=99.20%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;54633;213;307089;0;0;0.000000;0.000000;2092;6192483;4675.670231;24793.401679;1.000000%=2670;5.000000%=2899;10.000000%=3031;20.000000%=3227;30.000000%=3424;40.000000%=3555;50.000000%=3719;60.000000%=3883;70.000000%=4079;80.000000%=4358;90.000000%=5406;95.000000%=8716;99.000000%=23461;99.500000%=29229;99.900000%=50593;99.950000%=61603;99.990000%=210763;0%=0;0%=0;0%=0;2092;6192483;4676.018811;24793.402093;1539;78336;100.000000%;55642.617940;10858.259892;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.133187%;3.841570%;66332;0;76;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;66.54%;29.21%;2.78%;1.36%;0.08%;0.02%;0.00%;0.01%;0.00%;0.00%;0.01%;vda;65511;2855;0;11;296254;190869;487155;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=6860: Sun Jan  7 18:39:53 2024
  read: IOPS=213, BW=53.4MiB/s (55.9MB/s)(16.0GiB/307089msec)
    clat (msec): min=2, max=6192, avg= 4.68, stdev=24.79
     lat (msec): min=2, max=6192, avg= 4.68, stdev=24.79
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    6], 95.00th=[    9],
     | 99.00th=[   24], 99.50th=[   30], 99.90th=[   51], 99.95th=[   62],
     | 99.99th=[  211]
   bw (  KiB/s): min= 1539, max=78336, per=100.00%, avg=55642.62, stdev=10858.26, samples=602
   iops        : min=    6, max=  306, avg=217.29, stdev=42.39, samples=602
  lat (msec)   : 4=66.54%, 10=29.21%, 20=2.78%, 50=1.36%, 100=0.08%
  lat (msec)   : 250=0.02%, 750=0.01%, >=2000=0.01%
  cpu          : usr=0.13%, sys=3.84%, ctx=66332, majf=0, minf=76
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=53.4MiB/s (55.9MB/s), 53.4MiB/s-53.4MiB/s (55.9MB/s-55.9MB/s), io=16.0GiB (17.2GB), run=307089-307089msec

Disk stats (read/write):
  vda: ios=65511/2855, merge=0/11, ticks=296254/190869, in_queue=487155, util=100.00%